* TODO PRE
** TODO Introduction
** DONE pre-requisites
** DONE Symbology
* DONE Part I: Development[100%]

** DONE Setting up the development environment[6/6]

*** DONE Creating a new Rails app
    CLOCK: [2016-05-07 Sat 10:30]--[2016-05-07 Sat 10:41] =>  0:11

*** DONE Dockerizing the app
    CLOCK: [2016-05-07 Sat 10:41]--[2016-05-07 Sat 11:36] =>  0:55

*** DONE Adding a resource
    CLOCK: [2016-05-07 Sat 13:50]--[2016-05-07 Sat 14:05] =>  0:15

*** DONE Adding a production-ready Database
    CLOCK: [2016-05-07 Sat 16:52]--[2016-05-07 Sat 17:43] =>  0:51

*** DONE Adding a Search Engine
    CLOCK: [2016-05-07 Sat 21:30]--[2016-05-07 Sat 22:15] =>  0:45

*** DONE Pushing our project to DockerHub
    CLOCK: [2016-05-08 Sun 11:37]--[2016-05-08 Sun 11:45] =>  0:08
    
* DONE Part II: Production[100%]

** DONE Creating an AWS account
   
** DONE Kubernetes[4/4]

*** DONE Basic concepts

*** DONE Installing kb8 and creating the cluster
    CLOCK: [2016-05-08 Sun 15:43]--[2016-05-08 Sun 16:06] =>  0:23

*** DONE Creating pods and services for the DB and the SE
**** DONE Pods
**** DONE Services
**** DONE Data Persistence

*** DONE Creating an RC and a Service for our Application

**** DONE preparing the application for production
**** DONE creating the RC
**** DONE creating the service
**** DONE making changes (rolling updates)

* Part III: CI[0%]

** TODO Installing Jenkins on AWS

** TODO Installing some plugins

** TODO Configuring our project for deploy

** TODO Running our test suite

** TODO Adding an staging environment
